In [2]:
import pandas as pd

india_weather=pd.DataFrame({
    "city":["mumbai","delhi","banglore"],
    "temperature":[32,45,30],
    "humidity":[80,60,78]
})
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [4]:
us_weather=pd.DataFrame({
    "city":["new york","chicago","orlando"],
    "temperature":[21,14,35],
    "humidity":[68,65,75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

## using an index from original dataframe

In [5]:
pd.concat([india_weather,us_weather])

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

가장 왼쪽에 있는 index를 순서대로 나열

In [8]:
pd.concat([india_weather,us_weather],ignore_index=True)

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

합쳤다가 나중에 다시 쪼갤 필요가 있을때: 각 그룹을 대표하는 index를 keys 형태로 붙여둠

In [11]:
df= pd.concat([india_weather,us_weather], keys=["india","us"])
df

             city  temperature  humidity
india 0    mumbai           32        80
      1     delhi           45        60
      2  banglore           30        78
us    0  new york           21        68
      1   chicago           14        65
      2   orlando           35        75

In [12]:
df.loc['india']

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [14]:
df.loc['us']

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

## 지금까지는 append second data as row

## 이제부터 append second data as column

In [28]:
temperature_df=pd.DataFrame({
    'city':["mumbai","delhi","banglore"],
    'temperature': [32,45,30]
})

In [29]:
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [30]:
windspeed_df=pd.DataFrame({
    'city': ["mumbai","delhi","baglore"],
    'windspeed': [7,12,9]
})

In [31]:
pd.concat([temperature_df,windspeed_df])

/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  """Entry point for launching an IPython kernel.

       city  temperature  windspeed
0    mumbai         32.0        NaN
1     delhi         45.0        NaN
2  banglore         30.0        NaN
0    mumbai          NaN        7.0
1     delhi          NaN       12.0
2   baglore          NaN        9.0

In [32]:
pd.concat([temperature_df,windspeed_df], axis=1)

       city  temperature     city  windspeed
0    mumbai           32   mumbai          7
1     delhi           45    delhi         12
2  banglore           30  baglore          9

index의 순서가 바뀌어있거나 섞여있을때

In [38]:
windspeed_df=pd.DataFrame({
    'city': ["delhi","mumbai"],
    'windspeed': [7,12]
})

In [39]:
df=pd.concat([temperature_df,windspeed_df],axis=1)
df

       city  temperature    city  windspeed
0    mumbai           32   delhi        7.0
1     delhi           45  mumbai       12.0
2  banglore           30     NaN        NaN

순서가 섞여있을때 이를 index로 잘 맞게 붙여주기

## align rows from different dataframe

In [41]:
temperature_df=pd.DataFrame({
    'city':["mumbai","delhi","banglore"],
    'temperature': [32,45,30]
}, index=[0,1,2])

In [42]:
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [47]:
windspeed_df=pd.DataFrame({
    'city': ["delhi","mumbai"],
    'windspeed': [7,12]
},index=[1,0])

In [48]:
df=pd.concat([temperature_df,windspeed_df],axis=1)
df

       city  temperature    city  windspeed
0    mumbai           32  mumbai       12.0
1     delhi           45   delhi        7.0
2  banglore           30     NaN        NaN

## add new series in the dataframe as a column

In [50]:
s=pd.Series(["Humid","Dry","Rain"],name="event")
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [51]:
pd.concat([temperature_df,s],axis=1)

       city  temperature  event
0    mumbai           32  Humid
1     delhi           45    Dry
2  banglore           30   Rain

다음 시간에는 merge하는데, 앞에서 concat를 할때 index를 우리가 다 지정해줘야 맞게 붙었는데, 이를 자동으로 가능